In [3]:
import pandas as pd
import os
os.getcwd()
chdir="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(chdir)
os.listdir()
df=''
for file in os.listdir():
    if file.endswith(".csv") and file.startswith("chat"):
        df=pd.read_csv(file,index_col=0)
df

     Name  Age       City  Salary Joining_Date
ID
1   MIGIP   37     Mumbai   60351   2020-01-01
2   ZTFSC   27  Hyderabad   67832   2020-01-02
3   CYXGZ   33  Hyderabad   82975   2020-01-03
4   UAFLE   20     Mumbai   89665   2020-01-04
5   BXQSH   51    Chennai   74588   2020-01-05
6   VHCTP   56  Bangalore   99538   2020-01-06
7   KMAAX   19  Hyderabad   35914   2020-01-07
8   EAESD   19  Hyderabad   46150   2020-01-08
9   ZTXSK   46  Bangalore   73084   2020-01-09
10  HHYGG   41    Kolkata   84834   2020-01-10
11  CASBR   49  Hyderabad   87135   2020-01-11
12  KMYBT   19     Mumbai   82117   2020-01-12
13  WVCQK   49     Mumbai   79670   2020-01-13
14  QXCWB   60  Hyderabad   83518   2020-01-14
15  SKXIW   42     Mumbai   99316   2020-01-15
16  TGAHD   53  Bangalore   90320   2020-01-16
17  HLRJX   27      Delhi   80399   2020-01-17
18  LECUM   57     Mumbai   81076   2020-01-18
19  IVDWU   49     Mumbai   81276   2020-01-19
20  LSHGG   29    Chennai   51382   2020-01-20
21  EWPGB   46      Delhi   78403   2020-01-21
22  BTKYM   35      Delhi   50631   2020-01-22
23  HLCJC   59     Mumbai   91960   2020-01-23
24  HLRID   33    Kolkata   90718   2020-01-24
25  DVYEI   34    Chennai   96504   2020-01-25
26  NCLNC   49  Bangalore   60720   2020-01-26
27  NFESJ   50  Bangalore   67291   2020-01-27
28  CAYZK   58  Bangalore   68136   2020-01-28
29  EQHQX   58    Chennai   43237   2020-01-29
30  JHCDM   19      Delhi   78470   2020-01-30
31  HMPVQ   34    Chennai   26957   2020-01-31
32  VHGEO   59      Delhi   53315   2020-02-01
33  IREOX   18     Mumbai   99329   2020-02-02
34  VSAJR   26  Hyderabad   81706   2020-02-03
35  SEWHL   29     Mumbai   20531   2020-02-04
36  OLPAM   33      Delhi   52013   2020-02-05
37  RDOAO   56    Kolkata   72205   2020-02-06
38  UXNFS   20      Delhi   53090   2020-02-07
39  DILPY   32    Kolkata   36720   2020-02-08
40  TUTRA   49    Chennai   54007   2020-02-09
41  YFHAD   55      Delhi   45730   2020-02-10
42  PEKHD   42      Delhi   98914   2020-02-11
43  LBZUS   25    Kolkata   54088   2020-02-12
44  CUUVM   19     Mumbai   63173   2020-02-13
45  YYZER   59      Delhi   51215   2020-02-14
46  JXRMF   26  Hyderabad   81842   2020-02-15
47  ENGSH   19      Delhi   64520   2020-02-16
48  YWWRE   23    Chennai   44513   2020-02-17
49  AYBWC   22     Mumbai   39619   2020-02-18
50  CBSQE   59  Bangalore   77038   2020-02-19

In [4]:
df.head()

     Name  Age       City  Salary Joining_Date
ID
1   MIGIP   37     Mumbai   60351   2020-01-01
2   ZTFSC   27  Hyderabad   67832   2020-01-02
3   CYXGZ   33  Hyderabad   82975   2020-01-03
4   UAFLE   20     Mumbai   89665   2020-01-04
5   BXQSH   51    Chennai   74588   2020-01-05

In [5]:
df.describe()

             Age        Salary
count  50.000000     50.000000
mean   38.580000  68554.700000
std    14.533691  20435.925739
min    18.000000  20531.000000
25%    26.000000  52282.250000
50%    36.000000  72644.500000
75%    50.750000  82760.500000
max    60.000000  99538.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 1 to 50
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          50 non-null     object
 1   Age           50 non-null     int64
 2   City          50 non-null     object
 3   Salary        50 non-null     int64
 4   Joining_Date  50 non-null     object
dtypes: int64(2), object(3)
memory usage: 2.3+ KB

In [7]:
df["Age"].info()

<class 'pandas.core.series.Series'>
Index: 50 entries, 1 to 50
Series name: Age
Non-Null Count  Dtype
--------------  -----
50 non-null     int64
dtypes: int64(1)
memory usage: 800.0 bytes

In [8]:
df["Age"].shape

(50,)

In [9]:
df.shape

(50, 5)

In [10]:
df.size

250

In [11]:
df.ndim

2

In [12]:
df.columns

Index(['Name', 'Age', 'City', 'Salary', 'Joining_Date'], dtype='object')

In [13]:
df["Age"].dtype

dtype('int64')

In [14]:
df.array

AttributeError: 'DataFrame' object has no attribute 'array'

In [15]:
df["Age"].array

<NumpyExtensionArray>
[np.int64(37), np.int64(27), np.int64(33), np.int64(20), np.int64(51),
 np.int64(56), np.int64(19), np.int64(19), np.int64(46), np.int64(41),
 np.int64(49), np.int64(19), np.int64(49), np.int64(60), np.int64(42),
 np.int64(53), np.int64(27), np.int64(57), np.int64(49), np.int64(29),
 np.int64(46), np.int64(35), np.int64(59), np.int64(33), np.int64(34),
 np.int64(49), np.int64(50), np.int64(58), np.int64(58), np.int64(19),
 np.int64(34), np.int64(59), np.int64(18), np.int64(26), np.int64(29),
 np.int64(33), np.int64(56), np.int64(20), np.int64(32), np.int64(49),
 np.int64(55), np.int64(42), np.int64(25), np.int64(19), np.int64(59),
 np.int64(26), np.int64(19), np.int64(23), np.int64(22), np.int64(59)]
Length: 50, dtype: int64

In [16]:
df["Age"].astype("int8")

ID
1     37
2     27
3     33
4     20
5     51
6     56
7     19
8     19
9     46
10    41
11    49
12    19
13    49
14    60
15    42
16    53
17    27
18    57
19    49
20    29
21    46
22    35
23    59
24    33
25    34
26    49
27    50
28    58
29    58
30    19
31    34
32    59
33    18
34    26
35    29
36    33
37    56
38    20
39    32
40    49
41    55
42    42
43    25
44    19
45    59
46    26
47    19
48    23
49    22
50    59
Name: Age, dtype: int8

In [17]:
df.index

Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36,
       37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50],
      dtype='int64', name='ID')

In [18]:
df.head()

     Name  Age       City  Salary Joining_Date
ID
1   MIGIP   37     Mumbai   60351   2020-01-01
2   ZTFSC   27  Hyderabad   67832   2020-01-02
3   CYXGZ   33  Hyderabad   82975   2020-01-03
4   UAFLE   20     Mumbai   89665   2020-01-04
5   BXQSH   51    Chennai   74588   2020-01-05

In [19]:
df1=df["Salary"].apply(lambda x:x if x>50000 else None) 
df1.reset_index()

    ID   Salary
0    1  60351.0
1    2  67832.0
2    3  82975.0
3    4  89665.0
4    5  74588.0
5    6  99538.0
6    7      NaN
7    8      NaN
8    9  73084.0
9   10  84834.0
10  11  87135.0
11  12  82117.0
12  13  79670.0
13  14  83518.0
14  15  99316.0
15  16  90320.0
16  17  80399.0
17  18  81076.0
18  19  81276.0
19  20  51382.0
20  21  78403.0
21  22  50631.0
22  23  91960.0
23  24  90718.0
24  25  96504.0
25  26  60720.0
26  27  67291.0
27  28  68136.0
28  29      NaN
29  30  78470.0
30  31      NaN
31  32  53315.0
32  33  99329.0
33  34  81706.0
34  35      NaN
35  36  52013.0
36  37  72205.0
37  38  53090.0
38  39      NaN
39  40  54007.0
40  41      NaN
41  42  98914.0
42  43  54088.0
43  44  63173.0
44  45  51215.0
45  46  81842.0
46  47  64520.0
47  48      NaN
48  49      NaN
49  50  77038.0

In [20]:
df2=df[df["Salary"]>90000]
df2

     Name  Age       City  Salary Joining_Date
ID
6   VHCTP   56  Bangalore   99538   2020-01-06
15  SKXIW   42     Mumbai   99316   2020-01-15
16  TGAHD   53  Bangalore   90320   2020-01-16
23  HLCJC   59     Mumbai   91960   2020-01-23
24  HLRID   33    Kolkata   90718   2020-01-24
25  DVYEI   34    Chennai   96504   2020-01-25
33  IREOX   18     Mumbai   99329   2020-02-02
42  PEKHD   42      Delhi   98914   2020-02-11

In [21]:
df3=df[(df["Salary"]>80000) & (df["Age"]>50)]
df3

     Name  Age       City  Salary Joining_Date
ID
6   VHCTP   56  Bangalore   99538   2020-01-06
14  QXCWB   60  Hyderabad   83518   2020-01-14
16  TGAHD   53  Bangalore   90320   2020-01-16
18  LECUM   57     Mumbai   81076   2020-01-18
23  HLCJC   59     Mumbai   91960   2020-01-23

In [22]:
df4=df[(df["Salary"]<75000)*10]
df4

KeyError: "None of [Index([10, 10,  0,  0, 10,  0, 10, 10, 10,  0,  0,  0,  0,  0,  0,  0,  0,  0,\n        0, 10,  0, 10,  0,  0,  0, 10, 10, 10, 10,  0, 10, 10,  0,  0, 10, 10,\n       10, 10, 10, 10, 10,  0, 10, 10, 10,  0, 10, 10, 10,  0],\n      dtype='int64')] are in the [columns]"

In [23]:
df

     Name  Age       City  Salary Joining_Date
ID
1   MIGIP   37     Mumbai   60351   2020-01-01
2   ZTFSC   27  Hyderabad   67832   2020-01-02
3   CYXGZ   33  Hyderabad   82975   2020-01-03
4   UAFLE   20     Mumbai   89665   2020-01-04
5   BXQSH   51    Chennai   74588   2020-01-05
6   VHCTP   56  Bangalore   99538   2020-01-06
7   KMAAX   19  Hyderabad   35914   2020-01-07
8   EAESD   19  Hyderabad   46150   2020-01-08
9   ZTXSK   46  Bangalore   73084   2020-01-09
10  HHYGG   41    Kolkata   84834   2020-01-10
11  CASBR   49  Hyderabad   87135   2020-01-11
12  KMYBT   19     Mumbai   82117   2020-01-12
13  WVCQK   49     Mumbai   79670   2020-01-13
14  QXCWB   60  Hyderabad   83518   2020-01-14
15  SKXIW   42     Mumbai   99316   2020-01-15
16  TGAHD   53  Bangalore   90320   2020-01-16
17  HLRJX   27      Delhi   80399   2020-01-17
18  LECUM   57     Mumbai   81076   2020-01-18
19  IVDWU   49     Mumbai   81276   2020-01-19
20  LSHGG   29    Chennai   51382   2020-01-20
21  EWPGB   46      Delhi   78403   2020-01-21
22  BTKYM   35      Delhi   50631   2020-01-22
23  HLCJC   59     Mumbai   91960   2020-01-23
24  HLRID   33    Kolkata   90718   2020-01-24
25  DVYEI   34    Chennai   96504   2020-01-25
26  NCLNC   49  Bangalore   60720   2020-01-26
27  NFESJ   50  Bangalore   67291   2020-01-27
28  CAYZK   58  Bangalore   68136   2020-01-28
29  EQHQX   58    Chennai   43237   2020-01-29
30  JHCDM   19      Delhi   78470   2020-01-30
31  HMPVQ   34    Chennai   26957   2020-01-31
32  VHGEO   59      Delhi   53315   2020-02-01
33  IREOX   18     Mumbai   99329   2020-02-02
34  VSAJR   26  Hyderabad   81706   2020-02-03
35  SEWHL   29     Mumbai   20531   2020-02-04
36  OLPAM   33      Delhi   52013   2020-02-05
37  RDOAO   56    Kolkata   72205   2020-02-06
38  UXNFS   20      Delhi   53090   2020-02-07
39  DILPY   32    Kolkata   36720   2020-02-08
40  TUTRA   49    Chennai   54007   2020-02-09
41  YFHAD   55      Delhi   45730   2020-02-10
42  PEKHD   42      Delhi   98914   2020-02-11
43  LBZUS   25    Kolkata   54088   2020-02-12
44  CUUVM   19     Mumbai   63173   2020-02-13
45  YYZER   59      Delhi   51215   2020-02-14
46  JXRMF   26  Hyderabad   81842   2020-02-15
47  ENGSH   19      Delhi   64520   2020-02-16
48  YWWRE   23    Chennai   44513   2020-02-17
49  AYBWC   22     Mumbai   39619   2020-02-18
50  CBSQE   59  Bangalore   77038   2020-02-19

In [27]:
df4=df[(df["Age"]>50) | (df["Salary"]>90000)]
df4.head()

     Name  Age       City  Salary Joining_Date
ID
5   BXQSH   51    Chennai   74588   2020-01-05
6   VHCTP   56  Bangalore   99538   2020-01-06
14  QXCWB   60  Hyderabad   83518   2020-01-14
15  SKXIW   42     Mumbai   99316   2020-01-15
16  TGAHD   53  Bangalore   90320   2020-01-16

In [39]:
def salary_increment(salary):
    if salary<75000:
        return salary*2
    else:
        return salary
df["new_salary"]=df["Salary"].map(salary_increment)
df

     Name  Age       City  Salary Joining_Date  new_salary
ID
1   MIGIP   37     Mumbai   60351   2020-01-01      120702
2   ZTFSC   27  Hyderabad   67832   2020-01-02      135664
3   CYXGZ   33  Hyderabad   82975   2020-01-03       82975
4   UAFLE   20     Mumbai   89665   2020-01-04       89665
5   BXQSH   51    Chennai   74588   2020-01-05      149176
6   VHCTP   56  Bangalore   99538   2020-01-06       99538
7   KMAAX   19  Hyderabad   35914   2020-01-07       71828
8   EAESD   19  Hyderabad   46150   2020-01-08       92300
9   ZTXSK   46  Bangalore   73084   2020-01-09      146168
10  HHYGG   41    Kolkata   84834   2020-01-10       84834
11  CASBR   49  Hyderabad   87135   2020-01-11       87135
12  KMYBT   19     Mumbai   82117   2020-01-12       82117
13  WVCQK   49     Mumbai   79670   2020-01-13       79670
14  QXCWB   60  Hyderabad   83518   2020-01-14       83518
15  SKXIW   42     Mumbai   99316   2020-01-15       99316
16  TGAHD   53  Bangalore   90320   2020-01-16       90320
17  HLRJX   27      Delhi   80399   2020-01-17       80399
18  LECUM   57     Mumbai   81076   2020-01-18       81076
19  IVDWU   49     Mumbai   81276   2020-01-19       81276
20  LSHGG   29    Chennai   51382   2020-01-20      102764
21  EWPGB   46      Delhi   78403   2020-01-21       78403
22  BTKYM   35      Delhi   50631   2020-01-22      101262
23  HLCJC   59     Mumbai   91960   2020-01-23       91960
24  HLRID   33    Kolkata   90718   2020-01-24       90718
25  DVYEI   34    Chennai   96504   2020-01-25       96504
26  NCLNC   49  Bangalore   60720   2020-01-26      121440
27  NFESJ   50  Bangalore   67291   2020-01-27      134582
28  CAYZK   58  Bangalore   68136   2020-01-28      136272
29  EQHQX   58    Chennai   43237   2020-01-29       86474
30  JHCDM   19      Delhi   78470   2020-01-30       78470
31  HMPVQ   34    Chennai   26957   2020-01-31       53914
32  VHGEO   59      Delhi   53315   2020-02-01      106630
33  IREOX   18     Mumbai   99329   2020-02-02       99329
34  VSAJR   26  Hyderabad   81706   2020-02-03       81706
35  SEWHL   29     Mumbai   20531   2020-02-04       41062
36  OLPAM   33      Delhi   52013   2020-02-05      104026
37  RDOAO   56    Kolkata   72205   2020-02-06      144410
38  UXNFS   20      Delhi   53090   2020-02-07      106180
39  DILPY   32    Kolkata   36720   2020-02-08       73440
40  TUTRA   49    Chennai   54007   2020-02-09      108014
41  YFHAD   55      Delhi   45730   2020-02-10       91460
42  PEKHD   42      Delhi   98914   2020-02-11       98914
43  LBZUS   25    Kolkata   54088   2020-02-12      108176
44  CUUVM   19     Mumbai   63173   2020-02-13      126346
45  YYZER   59      Delhi   51215   2020-02-14      102430
46  JXRMF   26  Hyderabad   81842   2020-02-15       81842
47  ENGSH   19      Delhi   64520   2020-02-16      129040
48  YWWRE   23    Chennai   44513   2020-02-17       89026
49  AYBWC   22     Mumbai   39619   2020-02-18       79238
50  CBSQE   59  Bangalore   77038   2020-02-19       77038

In [42]:
def salary_increment(salary):
    if salary<75000:
        return salary*2
    else:
        return salary
df["new_salary"]=df["Salary"].map(salary_increment)
print(df[(df["new_salary"])>(df["Salary"])])

     Name  Age       City  Salary Joining_Date  new_salary
ID
1   MIGIP   37     Mumbai   60351   2020-01-01      120702
2   ZTFSC   27  Hyderabad   67832   2020-01-02      135664
5   BXQSH   51    Chennai   74588   2020-01-05      149176
7   KMAAX   19  Hyderabad   35914   2020-01-07       71828
8   EAESD   19  Hyderabad   46150   2020-01-08       92300
9   ZTXSK   46  Bangalore   73084   2020-01-09      146168
20  LSHGG   29    Chennai   51382   2020-01-20      102764
22  BTKYM   35      Delhi   50631   2020-01-22      101262
26  NCLNC   49  Bangalore   60720   2020-01-26      121440
27  NFESJ   50  Bangalore   67291   2020-01-27      134582
28  CAYZK   58  Bangalore   68136   2020-01-28      136272
29  EQHQX   58    Chennai   43237   2020-01-29       86474
31  HMPVQ   34    Chennai   26957   2020-01-31       53914
32  VHGEO   59      Delhi   53315   2020-02-01      106630
35  SEWHL   29     Mumbai   20531   2020-02-04       41062
36  OLPAM   33      Delhi   52013   2020-02-05      104026
37  RDOAO   56    Kolkata   72205   2020-02-06      144410
38  UXNFS   20      Delhi   53090   2020-02-07      106180
39  DILPY   32    Kolkata   36720   2020-02-08       73440
40  TUTRA   49    Chennai   54007   2020-02-09      108014
41  YFHAD   55      Delhi   45730   2020-02-10       91460
43  LBZUS   25    Kolkata   54088   2020-02-12      108176
44  CUUVM   19     Mumbai   63173   2020-02-13      126346
45  YYZER   59      Delhi   51215   2020-02-14      102430
47  ENGSH   19      Delhi   64520   2020-02-16      129040
48  YWWRE   23    Chennai   44513   2020-02-17       89026
49  AYBWC   22     Mumbai   39619   2020-02-18       79238

In [49]:
df6=df["Salary"].apply(lambda x: x if x>99000 else None)

In [51]:
df6.reset_index()

    ID   Salary
0    1      NaN
1    2      NaN
2    3      NaN
3    4      NaN
4    5      NaN
5    6  99538.0
6    7      NaN
7    8      NaN
8    9      NaN
9   10      NaN
10  11      NaN
11  12      NaN
12  13      NaN
13  14      NaN
14  15  99316.0
15  16      NaN
16  17      NaN
17  18      NaN
18  19      NaN
19  20      NaN
20  21      NaN
21  22      NaN
22  23      NaN
23  24      NaN
24  25      NaN
25  26      NaN
26  27      NaN
27  28      NaN
28  29      NaN
29  30      NaN
30  31      NaN
31  32      NaN
32  33  99329.0
33  34      NaN
34  35      NaN
35  36      NaN
36  37      NaN
37  38      NaN
38  39      NaN
39  40      NaN
40  41      NaN
41  42      NaN
42  43      NaN
43  44      NaN
44  45      NaN
45  46      NaN
46  47      NaN
47  48      NaN
48  49      NaN
49  50      NaN

In [53]:
df7=df["Salary"]>99000
df[df7]

     Name  Age       City  Salary Joining_Date  new_salary
ID
6   VHCTP   56  Bangalore   99538   2020-01-06       99538
15  SKXIW   42     Mumbai   99316   2020-01-15       99316
33  IREOX   18     Mumbai   99329   2020-02-02       99329

In [56]:
import pandas as pd
import os 
os.getcwd()
df=pd.read_csv("sample_with_missing_values.csv")
df

      Name   Age         City  Score
0    Alice  25.0     New York   85.0
1      Bob   NaN  Los Angeles   90.0
2  Charlie  30.0          NaN    NaN
3    David  22.0      Chicago   88.0
4      Eve   NaN      Houston   92.0

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     3 non-null      float64
 2   City    4 non-null      object
 3   Score   4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [58]:
df["Age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: Age
Non-Null Count  Dtype
--------------  -----
3 non-null      float64
dtypes: float64(1)
memory usage: 172.0 bytes

In [59]:
df["Age"].describe()

count     3.000000
mean     25.666667
std       4.041452
min      22.000000
25%      23.500000
50%      25.000000
75%      27.500000
max      30.000000
Name: Age, dtype: float64

In [60]:
df.describe().reset_index()

   index        Age      Score
0  count   3.000000   4.000000
1   mean  25.666667  88.750000
2    std   4.041452   2.986079
3    min  22.000000  85.000000
4    25%  23.500000  87.250000
5    50%  25.000000  89.000000
6    75%  27.500000  90.500000
7    max  30.000000  92.000000

In [61]:
df.ndim

2

In [62]:
df.shape

(5, 4)

In [63]:
df.size

20

In [73]:
df["Age"].dtype

dtype('float64')

In [72]:
df["Age"].astype("int8")

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [75]:
df["Age"].array

<NumpyExtensionArray>
[np.float64(25.0),  np.float64(nan), np.float64(30.0), np.float64(22.0),
  np.float64(nan)]
Length: 5, dtype: float64

In [76]:
df.columns

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [77]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [78]:
df

      Name   Age         City  Score
0    Alice  25.0     New York   85.0
1      Bob   NaN  Los Angeles   90.0
2  Charlie  30.0          NaN    NaN
3    David  22.0      Chicago   88.0
4      Eve   NaN      Houston   92.0

In [79]:
def age_filter(age):
    if age>23:
        return age
    else:
        None
df1=df["Age"].apply(age_filter)

In [80]:
df1

0    25.0
1     NaN
2    30.0
3     NaN
4     NaN
Name: Age, dtype: float64

In [81]:
df2=df["Age"]=="NaN"
df[df2]

Empty DataFrame
Columns: [Name, Age, City, Score]
Index: []

In [82]:
df3=df["City"]=="NaN"
df[df3]

Empty DataFrame
Columns: [Name, Age, City, Score]
Index: []

In [83]:
df4=df["Age"]>26
df[df4]

      Name   Age City  Score
2  Charlie  30.0  NaN    NaN

In [86]:
df5=df["Score"]<90
df[df5]

    Name   Age      City  Score
0  Alice  25.0  New York   85.0
3  David  22.0   Chicago   88.0

In [88]:
df6=df[len(df["Name"])]>5
df[df6]

KeyError: 5

In [89]:
df

      Name   Age         City  Score
0    Alice  25.0     New York   85.0
1      Bob   NaN  Los Angeles   90.0
2  Charlie  30.0          NaN    NaN
3    David  22.0      Chicago   88.0
4      Eve   NaN      Houston   92.0

In [91]:
df7=df["Name"]=="NaN"
df[df7]

Empty DataFrame
Columns: [Name, Age, City, Score]
Index: []

In [96]:
df8=df["Score"]==10
df[df8]

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   NaN  Los Angeles     10
2  Charlie  30.0          NaN     10
3    David  22.0      Chicago     10
4      Eve   NaN      Houston     10

In [99]:
df9=df.loc[0,"Score"]+20
df9

np.int64(30)

In [107]:
df10=df.loc[[0,1,2,3],["Score"]]*20
df10

   Score
0    200
1    200
2    200
3    200

In [108]:
df

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   NaN  Los Angeles     10
2  Charlie  30.0          NaN     10
3    David  22.0      Chicago     10
4      Eve   NaN      Houston     10

In [110]:
df11=df["Score"].apply(lambda x:x*12.4)
df11

0    124.0
1    124.0
2    124.0
3    124.0
4    124.0
Name: Score, dtype: float64

In [111]:
df.dropna()

    Name   Age      City  Score
0  Alice  25.0  New York     10
3  David  22.0   Chicago     10

In [113]:
df

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   NaN  Los Angeles     10
2  Charlie  30.0          NaN     10
3    David  22.0      Chicago     10
4      Eve   NaN      Houston     10

In [114]:
df["Age"].fillna(0)

0    25.0
1     0.0
2    30.0
3    22.0
4     0.0
Name: Age, dtype: float64

In [115]:
df

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   NaN  Los Angeles     10
2  Charlie  30.0          NaN     10
3    David  22.0      Chicago     10
4      Eve   NaN      Houston     10

In [118]:
df["Age"].fillna(0,inplace=True)
df

C:\Users\talib\AppData\Local\Temp\ipykernel_21836\1617960123.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(0,inplace=True)

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   0.0  Los Angeles     10
2  Charlie  30.0          NaN     10
3    David  22.0      Chicago     10
4      Eve   0.0      Houston     10

In [119]:
df["City"].fillna("Unknown",inplace=True)
df

C:\Users\talib\AppData\Local\Temp\ipykernel_21836\1513097556.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["City"].fillna("Unknown",inplace=True)

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   0.0  Los Angeles     10
2  Charlie  30.0      Unknown     10
3    David  22.0      Chicago     10
4      Eve   0.0      Houston     10

In [120]:
df

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   0.0  Los Angeles     10
2  Charlie  30.0      Unknown     10
3    David  22.0      Chicago     10
4      Eve   0.0      Houston     10

In [122]:
df12=df.groupby("Name")["Score"].sum().reset_index()
df12

      Name  Score
0    Alice     10
1      Bob     10
2  Charlie     10
3    David     10
4      Eve     10

In [125]:
df13=df["Score"].rolling(window=2).mean()
df13

0     NaN
1    10.0
2    10.0
3    10.0
4    10.0
Name: Score, dtype: float64

In [126]:
d14=df["Score"].rolling(window=2).sum()
d14

0     NaN
1    20.0
2    20.0
3    20.0
4    20.0
Name: Score, dtype: float64

In [127]:
df

      Name   Age         City  Score
0    Alice  25.0     New York     10
1      Bob   0.0  Los Angeles     10
2  Charlie  30.0      Unknown     10
3    David  22.0      Chicago     10
4      Eve   0.0      Houston     10

In [128]:
df15=df.rename(columns={"Score":"result","Age":"Old Year"})
df15

      Name  Old Year         City  result
0    Alice      25.0     New York      10
1      Bob       0.0  Los Angeles      10
2  Charlie      30.0      Unknown      10
3    David      22.0      Chicago      10
4      Eve       0.0      Houston      10

In [137]:
# inplace change
df.rename(columns={"Name":"Students_name","City":"Living_Place","Score":"Marks_Obtained"})
df

  Students_name   Age Living_Place  Marks_Obtained
0         Alice  25.0     New York              10
1           Bob   0.0  Los Angeles              10
2       Charlie  30.0      Unknown              10
3         David  22.0      Chicago              10
4           Eve   0.0      Houston              10

In [138]:
df

  Students_name   Age Living_Place  Marks_Obtained
0         Alice  25.0     New York              10
1           Bob   0.0  Los Angeles              10
2       Charlie  30.0      Unknown              10
3         David  22.0      Chicago              10
4           Eve   0.0      Houston              10

In [141]:
df17=df.sort_values(by=["Age"])
df17

  Students_name   Age Living_Place  Marks_Obtained
1           Bob   0.0  Los Angeles              10
4           Eve   0.0      Houston              10
3         David  22.0      Chicago              10
0         Alice  25.0     New York              10
2       Charlie  30.0      Unknown              10

In [142]:
df17=df.sort_values(by=["Age","Marks_Obtained"],ascending=[True,False])
df17

  Students_name   Age Living_Place  Marks_Obtained
1           Bob   0.0  Los Angeles              10
4           Eve   0.0      Houston              10
3         David  22.0      Chicago              10
0         Alice  25.0     New York              10
2       Charlie  30.0      Unknown              10

In [143]:
import pandas as pd
import os
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [144]:
df=pd.read_csv("large_sample_with_missing_values.csv")
df

       Name   Age         City  Score
0       Bob  49.0  Los Angeles   93.0
1       Bob   NaN      Seattle   88.0
2      Hank  37.0      Chicago    NaN
3     Frank  25.0      Chicago   98.0
4     Alice  33.0      Seattle   73.0
5       Bob  36.0      Phoenix   83.0
6     Grace  36.0      Seattle   56.0
7      Hank  30.0  Los Angeles   98.0
8     Alice  22.0      Phoenix   86.0
9     Frank  59.0     New York   81.0
10    Grace  29.0      Houston   53.0
11      Bob  30.0          NaN   55.0
12    Frank  47.0          NaN   68.0
13  Charlie  36.0      Phoenix   78.0
14     Hank  58.0          NaN   79.0
15      NaN   NaN          NaN   90.0
16     Hank  54.0      Phoenix   65.0
17      NaN  37.0          NaN   95.0
18     Hank  50.0      Seattle   66.0
19    David  34.0     New York   66.0
20      NaN  31.0      Seattle   71.0
21      NaN   NaN      Houston    NaN
22    Alice  25.0          NaN   76.0
23      Bob   NaN      Chicago   64.0
24    Grace  25.0     New York   56.0
25    David  22.0      Houston   82.0
26      Eve  48.0  Los Angeles   67.0
27     Hank  40.0      Chicago   69.0
28    Frank  47.0     New York   80.0
29    David  25.0      Phoenix    NaN
30      NaN  58.0      Seattle   54.0
31     Hank  22.0     New York   52.0
32     Hank  55.0          NaN   94.0
33      NaN  33.0      Seattle   53.0
34    Alice  20.0          NaN   69.0
35      Eve  47.0      Houston   86.0
36    Frank  57.0          NaN   52.0
37    Frank  60.0      Chicago    NaN
38      NaN  45.0  Los Angeles   57.0
39     Hank  59.0  Los Angeles   92.0
40     Hank  27.0          NaN   84.0
41  Charlie  32.0          NaN   74.0
42    David  49.0      Chicago   58.0
43    David  44.0     New York    NaN
44    Alice  37.0     New York   55.0
45    Alice  29.0     New York   97.0
46    Grace  45.0  Los Angeles   54.0
47  Charlie  19.0      Chicago   61.0
48      Eve  25.0      Chicago   74.0
49    David  33.0      Seattle  100.0

In [145]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    43 non-null     object
 1   Age     46 non-null     float64
 2   City    39 non-null     object
 3   Score   45 non-null     float64
dtypes: float64(2), object(2)
memory usage: 1.7+ KB

In [146]:
df.describe()

             Age       Score
count  46.000000   45.000000
mean   38.282609   73.377778
std    12.324615   15.202106
min    19.000000   52.000000
25%    29.000000   58.000000
50%    36.000000   73.000000
75%    47.750000   86.000000
max    60.000000  100.000000

In [147]:
df.ndim

2

In [148]:
df.shape

(50, 4)

In [149]:
df.size

200

In [150]:
df.columns

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [151]:
df.index

RangeIndex(start=0, stop=50, step=1)

In [152]:
df["Age"].dtype

dtype('float64')

In [153]:
df["Age"].array

<NumpyExtensionArray>
[np.float64(49.0),  np.float64(nan), np.float64(37.0), np.float64(25.0),
 np.float64(33.0), np.float64(36.0), np.float64(36.0), np.float64(30.0),
 np.float64(22.0), np.float64(59.0), np.float64(29.0), np.float64(30.0),
 np.float64(47.0), np.float64(36.0), np.float64(58.0),  np.float64(nan),
 np.float64(54.0), np.float64(37.0), np.float64(50.0), np.float64(34.0),
 np.float64(31.0),  np.float64(nan), np.float64(25.0),  np.float64(nan),
 np.float64(25.0), np.float64(22.0), np.float64(48.0), np.float64(40.0),
 np.float64(47.0), np.float64(25.0), np.float64(58.0), np.float64(22.0),
 np.float64(55.0), np.float64(33.0), np.float64(20.0), np.float64(47.0),
 np.float64(57.0), np.float64(60.0), np.float64(45.0), np.float64(59.0),
 np.float64(27.0), np.float64(32.0), np.float64(49.0), np.float64(44.0),
 np.float64(37.0), np.float64(29.0), np.float64(45.0), np.float64(19.0),
 np.float64(25.0), np.float64(33.0)]
Length: 50, dtype: float64

In [154]:
df["Age"].astype("int8")

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [155]:
df.head()

    Name   Age         City  Score
0    Bob  49.0  Los Angeles   93.0
1    Bob   NaN      Seattle   88.0
2   Hank  37.0      Chicago    NaN
3  Frank  25.0      Chicago   98.0
4  Alice  33.0      Seattle   73.0

In [156]:
df.tail()

       Name   Age         City  Score
45    Alice  29.0     New York   97.0
46    Grace  45.0  Los Angeles   54.0
47  Charlie  19.0      Chicago   61.0
48      Eve  25.0      Chicago   74.0
49    David  33.0      Seattle  100.0

In [158]:
df1=df["Score"]==90
df[df1]

   Name  Age City  Score
15  NaN  NaN  NaN   90.0

In [160]:
df2=df["Score"]>90
df[df2]

     Name   Age         City  Score
0     Bob  49.0  Los Angeles   93.0
3   Frank  25.0      Chicago   98.0
7    Hank  30.0  Los Angeles   98.0
17    NaN  37.0          NaN   95.0
32   Hank  55.0          NaN   94.0
39   Hank  59.0  Los Angeles   92.0
45  Alice  29.0     New York   97.0
49  David  33.0      Seattle  100.0

In [161]:
df3=df["Score"]==98
df[df3]

    Name   Age         City  Score
3  Frank  25.0      Chicago   98.0
7   Hank  30.0  Los Angeles   98.0

In [163]:
df4=df.groupby("Name")["Score"].sum()
df4

Name
Alice      456.0
Bob        383.0
Charlie    213.0
David      306.0
Eve        227.0
Frank      379.0
Grace      219.0
Hank       699.0
Name: Score, dtype: float64

In [164]:
df5=df["Age"].rolling(window=3).mean()
df5

0           NaN
1           NaN
2           NaN
3           NaN
4     31.666667
5     31.333333
6     35.000000
7     34.000000
8     29.333333
9     37.000000
10    36.666667
11    39.333333
12    35.333333
13    37.666667
14    47.000000
15          NaN
16          NaN
17          NaN
18    47.000000
19    40.333333
20    38.333333
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26    31.666667
27    36.666667
28    45.000000
29    37.333333
30    43.333333
31    35.000000
32    45.000000
33    36.666667
34    36.000000
35    33.333333
36    41.333333
37    54.666667
38    54.000000
39    54.666667
40    43.666667
41    39.333333
42    36.000000
43    41.666667
44    43.333333
45    36.666667
46    37.000000
47    31.000000
48    29.666667
49    25.666667
Name: Age, dtype: float64

In [166]:
df6=df.rename(columns={"Age":"Lived_years"})
df6

       Name  Lived_years         City  Score
0       Bob         49.0  Los Angeles   93.0
1       Bob          NaN      Seattle   88.0
2      Hank         37.0      Chicago    NaN
3     Frank         25.0      Chicago   98.0
4     Alice         33.0      Seattle   73.0
5       Bob         36.0      Phoenix   83.0
6     Grace         36.0      Seattle   56.0
7      Hank         30.0  Los Angeles   98.0
8     Alice         22.0      Phoenix   86.0
9     Frank         59.0     New York   81.0
10    Grace         29.0      Houston   53.0
11      Bob         30.0          NaN   55.0
12    Frank         47.0          NaN   68.0
13  Charlie         36.0      Phoenix   78.0
14     Hank         58.0          NaN   79.0
15      NaN          NaN          NaN   90.0
16     Hank         54.0      Phoenix   65.0
17      NaN         37.0          NaN   95.0
18     Hank         50.0      Seattle   66.0
19    David         34.0     New York   66.0
20      NaN         31.0      Seattle   71.0
21      NaN          NaN      Houston    NaN
22    Alice         25.0          NaN   76.0
23      Bob          NaN      Chicago   64.0
24    Grace         25.0     New York   56.0
25    David         22.0      Houston   82.0
26      Eve         48.0  Los Angeles   67.0
27     Hank         40.0      Chicago   69.0
28    Frank         47.0     New York   80.0
29    David         25.0      Phoenix    NaN
30      NaN         58.0      Seattle   54.0
31     Hank         22.0     New York   52.0
32     Hank         55.0          NaN   94.0
33      NaN         33.0      Seattle   53.0
34    Alice         20.0          NaN   69.0
35      Eve         47.0      Houston   86.0
36    Frank         57.0          NaN   52.0
37    Frank         60.0      Chicago    NaN
38      NaN         45.0  Los Angeles   57.0
39     Hank         59.0  Los Angeles   92.0
40     Hank         27.0          NaN   84.0
41  Charlie         32.0          NaN   74.0
42    David         49.0      Chicago   58.0
43    David         44.0     New York    NaN
44    Alice         37.0     New York   55.0
45    Alice         29.0     New York   97.0
46    Grace         45.0  Los Angeles   54.0
47  Charlie         19.0      Chicago   61.0
48      Eve         25.0      Chicago   74.0
49    David         33.0      Seattle  100.0

In [167]:
# inplace
df.rename(columns={"Age":"Old_year","Score":"Marks_Obtained"})

       Name  Old_year         City  Marks_Obtained
0       Bob      49.0  Los Angeles            93.0
1       Bob       NaN      Seattle            88.0
2      Hank      37.0      Chicago             NaN
3     Frank      25.0      Chicago            98.0
4     Alice      33.0      Seattle            73.0
5       Bob      36.0      Phoenix            83.0
6     Grace      36.0      Seattle            56.0
7      Hank      30.0  Los Angeles            98.0
8     Alice      22.0      Phoenix            86.0
9     Frank      59.0     New York            81.0
10    Grace      29.0      Houston            53.0
11      Bob      30.0          NaN            55.0
12    Frank      47.0          NaN            68.0
13  Charlie      36.0      Phoenix            78.0
14     Hank      58.0          NaN            79.0
15      NaN       NaN          NaN            90.0
16     Hank      54.0      Phoenix            65.0
17      NaN      37.0          NaN            95.0
18     Hank      50.0      Seattle            66.0
19    David      34.0     New York            66.0
20      NaN      31.0      Seattle            71.0
21      NaN       NaN      Houston             NaN
22    Alice      25.0          NaN            76.0
23      Bob       NaN      Chicago            64.0
24    Grace      25.0     New York            56.0
25    David      22.0      Houston            82.0
26      Eve      48.0  Los Angeles            67.0
27     Hank      40.0      Chicago            69.0
28    Frank      47.0     New York            80.0
29    David      25.0      Phoenix             NaN
30      NaN      58.0      Seattle            54.0
31     Hank      22.0     New York            52.0
32     Hank      55.0          NaN            94.0
33      NaN      33.0      Seattle            53.0
34    Alice      20.0          NaN            69.0
35      Eve      47.0      Houston            86.0
36    Frank      57.0          NaN            52.0
37    Frank      60.0      Chicago             NaN
38      NaN      45.0  Los Angeles            57.0
39     Hank      59.0  Los Angeles            92.0
40     Hank      27.0          NaN            84.0
41  Charlie      32.0          NaN            74.0
42    David      49.0      Chicago            58.0
43    David      44.0     New York             NaN
44    Alice      37.0     New York            55.0
45    Alice      29.0     New York            97.0
46    Grace      45.0  Los Angeles            54.0
47  Charlie      19.0      Chicago            61.0
48      Eve      25.0      Chicago            74.0
49    David      33.0      Seattle           100.0

In [168]:
df.dropna()

       Name   Age         City  Score
0       Bob  49.0  Los Angeles   93.0
3     Frank  25.0      Chicago   98.0
4     Alice  33.0      Seattle   73.0
5       Bob  36.0      Phoenix   83.0
6     Grace  36.0      Seattle   56.0
7      Hank  30.0  Los Angeles   98.0
8     Alice  22.0      Phoenix   86.0
9     Frank  59.0     New York   81.0
10    Grace  29.0      Houston   53.0
13  Charlie  36.0      Phoenix   78.0
16     Hank  54.0      Phoenix   65.0
18     Hank  50.0      Seattle   66.0
19    David  34.0     New York   66.0
24    Grace  25.0     New York   56.0
25    David  22.0      Houston   82.0
26      Eve  48.0  Los Angeles   67.0
27     Hank  40.0      Chicago   69.0
28    Frank  47.0     New York   80.0
31     Hank  22.0     New York   52.0
35      Eve  47.0      Houston   86.0
39     Hank  59.0  Los Angeles   92.0
42    David  49.0      Chicago   58.0
44    Alice  37.0     New York   55.0
45    Alice  29.0     New York   97.0
46    Grace  45.0  Los Angeles   54.0
47  Charlie  19.0      Chicago   61.0
48      Eve  25.0      Chicago   74.0
49    David  33.0      Seattle  100.0

In [169]:
df

       Name   Age         City  Score
0       Bob  49.0  Los Angeles   93.0
1       Bob   NaN      Seattle   88.0
2      Hank  37.0      Chicago    NaN
3     Frank  25.0      Chicago   98.0
4     Alice  33.0      Seattle   73.0
5       Bob  36.0      Phoenix   83.0
6     Grace  36.0      Seattle   56.0
7      Hank  30.0  Los Angeles   98.0
8     Alice  22.0      Phoenix   86.0
9     Frank  59.0     New York   81.0
10    Grace  29.0      Houston   53.0
11      Bob  30.0          NaN   55.0
12    Frank  47.0          NaN   68.0
13  Charlie  36.0      Phoenix   78.0
14     Hank  58.0          NaN   79.0
15      NaN   NaN          NaN   90.0
16     Hank  54.0      Phoenix   65.0
17      NaN  37.0          NaN   95.0
18     Hank  50.0      Seattle   66.0
19    David  34.0     New York   66.0
20      NaN  31.0      Seattle   71.0
21      NaN   NaN      Houston    NaN
22    Alice  25.0          NaN   76.0
23      Bob   NaN      Chicago   64.0
24    Grace  25.0     New York   56.0
25    David  22.0      Houston   82.0
26      Eve  48.0  Los Angeles   67.0
27     Hank  40.0      Chicago   69.0
28    Frank  47.0     New York   80.0
29    David  25.0      Phoenix    NaN
30      NaN  58.0      Seattle   54.0
31     Hank  22.0     New York   52.0
32     Hank  55.0          NaN   94.0
33      NaN  33.0      Seattle   53.0
34    Alice  20.0          NaN   69.0
35      Eve  47.0      Houston   86.0
36    Frank  57.0          NaN   52.0
37    Frank  60.0      Chicago    NaN
38      NaN  45.0  Los Angeles   57.0
39     Hank  59.0  Los Angeles   92.0
40     Hank  27.0          NaN   84.0
41  Charlie  32.0          NaN   74.0
42    David  49.0      Chicago   58.0
43    David  44.0     New York    NaN
44    Alice  37.0     New York   55.0
45    Alice  29.0     New York   97.0
46    Grace  45.0  Los Angeles   54.0
47  Charlie  19.0      Chicago   61.0
48      Eve  25.0      Chicago   74.0
49    David  33.0      Seattle  100.0

In [171]:
df.fillna("UNKNOWN",inplace=True)
df

       Name      Age         City    Score
0       Bob     49.0  Los Angeles     93.0
1       Bob  UNKNOWN      Seattle     88.0
2      Hank     37.0      Chicago  UNKNOWN
3     Frank     25.0      Chicago     98.0
4     Alice     33.0      Seattle     73.0
5       Bob     36.0      Phoenix     83.0
6     Grace     36.0      Seattle     56.0
7      Hank     30.0  Los Angeles     98.0
8     Alice     22.0      Phoenix     86.0
9     Frank     59.0     New York     81.0
10    Grace     29.0      Houston     53.0
11      Bob     30.0      UNKNOWN     55.0
12    Frank     47.0      UNKNOWN     68.0
13  Charlie     36.0      Phoenix     78.0
14     Hank     58.0      UNKNOWN     79.0
15  UNKNOWN  UNKNOWN      UNKNOWN     90.0
16     Hank     54.0      Phoenix     65.0
17  UNKNOWN     37.0      UNKNOWN     95.0
18     Hank     50.0      Seattle     66.0
19    David     34.0     New York     66.0
20  UNKNOWN     31.0      Seattle     71.0
21  UNKNOWN  UNKNOWN      Houston  UNKNOWN
22    Alice     25.0      UNKNOWN     76.0
23      Bob  UNKNOWN      Chicago     64.0
24    Grace     25.0     New York     56.0
25    David     22.0      Houston     82.0
26      Eve     48.0  Los Angeles     67.0
27     Hank     40.0      Chicago     69.0
28    Frank     47.0     New York     80.0
29    David     25.0      Phoenix  UNKNOWN
30  UNKNOWN     58.0      Seattle     54.0
31     Hank     22.0     New York     52.0
32     Hank     55.0      UNKNOWN     94.0
33  UNKNOWN     33.0      Seattle     53.0
34    Alice     20.0      UNKNOWN     69.0
35      Eve     47.0      Houston     86.0
36    Frank     57.0      UNKNOWN     52.0
37    Frank     60.0      Chicago  UNKNOWN
38  UNKNOWN     45.0  Los Angeles     57.0
39     Hank     59.0  Los Angeles     92.0
40     Hank     27.0      UNKNOWN     84.0
41  Charlie     32.0      UNKNOWN     74.0
42    David     49.0      Chicago     58.0
43    David     44.0     New York  UNKNOWN
44    Alice     37.0     New York     55.0
45    Alice     29.0     New York     97.0
46    Grace     45.0  Los Angeles     54.0
47  Charlie     19.0      Chicago     61.0
48      Eve     25.0      Chicago     74.0
49    David     33.0      Seattle    100.0

In [175]:
df.sort_values(by=["Name","Score"],ascending=[True,False])

       Name      Age         City    Score
45    Alice     29.0     New York     97.0
8     Alice     22.0      Phoenix     86.0
22    Alice     25.0      UNKNOWN     76.0
4     Alice     33.0      Seattle     73.0
34    Alice     20.0      UNKNOWN     69.0
44    Alice     37.0     New York     55.0
0       Bob     49.0  Los Angeles     93.0
1       Bob  UNKNOWN      Seattle     88.0
5       Bob     36.0      Phoenix     83.0
23      Bob  UNKNOWN      Chicago     64.0
11      Bob     30.0      UNKNOWN     55.0
13  Charlie     36.0      Phoenix     78.0
41  Charlie     32.0      UNKNOWN     74.0
47  Charlie     19.0      Chicago     61.0
29    David     25.0      Phoenix  UNKNOWN
43    David     44.0     New York  UNKNOWN
49    David     33.0      Seattle    100.0
25    David     22.0      Houston     82.0
19    David     34.0     New York     66.0
42    David     49.0      Chicago     58.0
35      Eve     47.0      Houston     86.0
48      Eve     25.0      Chicago     74.0
26      Eve     48.0  Los Angeles     67.0
37    Frank     60.0      Chicago  UNKNOWN
3     Frank     25.0      Chicago     98.0
9     Frank     59.0     New York     81.0
28    Frank     47.0     New York     80.0
12    Frank     47.0      UNKNOWN     68.0
36    Frank     57.0      UNKNOWN     52.0
6     Grace     36.0      Seattle     56.0
24    Grace     25.0     New York     56.0
46    Grace     45.0  Los Angeles     54.0
10    Grace     29.0      Houston     53.0
2      Hank     37.0      Chicago  UNKNOWN
7      Hank     30.0  Los Angeles     98.0
32     Hank     55.0      UNKNOWN     94.0
39     Hank     59.0  Los Angeles     92.0
40     Hank     27.0      UNKNOWN     84.0
14     Hank     58.0      UNKNOWN     79.0
27     Hank     40.0      Chicago     69.0
18     Hank     50.0      Seattle     66.0
16     Hank     54.0      Phoenix     65.0
31     Hank     22.0     New York     52.0
21  UNKNOWN  UNKNOWN      Houston  UNKNOWN
17  UNKNOWN     37.0      UNKNOWN     95.0
15  UNKNOWN  UNKNOWN      UNKNOWN     90.0
20  UNKNOWN     31.0      Seattle     71.0
38  UNKNOWN     45.0  Los Angeles     57.0
30  UNKNOWN     58.0      Seattle     54.0
33  UNKNOWN     33.0      Seattle     53.0

In [179]:
df.value_counts("Name")

Name
Hank       10
UNKNOWN     7
Alice       6
David       6
Frank       6
Bob         5
Grace       4
Eve         3
Charlie     3
Name: count, dtype: int64

In [184]:
df9=df.value_counts(normalize=False)
df9

Name     Age      City         Score
Alice    20.0     UNKNOWN      69.0       1
         22.0     Phoenix      86.0       1
         25.0     UNKNOWN      76.0       1
         29.0     New York     97.0       1
         33.0     Seattle      73.0       1
         37.0     New York     55.0       1
Bob      30.0     UNKNOWN      55.0       1
         36.0     Phoenix      83.0       1
         49.0     Los Angeles  93.0       1
         UNKNOWN  Chicago      64.0       1
                  Seattle      88.0       1
Charlie  19.0     Chicago      61.0       1
         32.0     UNKNOWN      74.0       1
         36.0     Phoenix      78.0       1
David    22.0     Houston      82.0       1
         25.0     Phoenix      UNKNOWN    1
         33.0     Seattle      100.0      1
         34.0     New York     66.0       1
         44.0     New York     UNKNOWN    1
         49.0     Chicago      58.0       1
Eve      25.0     Chicago      74.0       1
         47.0     Houston      86.0       1
         48.0     Los Angeles  67.0       1
Frank    25.0     Chicago      98.0       1
         47.0     New York     80.0       1
                  UNKNOWN      68.0       1
         57.0     UNKNOWN      52.0       1
         59.0     New York     81.0       1
         60.0     Chicago      UNKNOWN    1
Grace    25.0     New York     56.0       1
         29.0     Houston      53.0       1
         36.0     Seattle      56.0       1
         45.0     Los Angeles  54.0       1
Hank     22.0     New York     52.0       1
         27.0     UNKNOWN      84.0       1
         30.0     Los Angeles  98.0       1
         37.0     Chicago      UNKNOWN    1
         40.0     Chicago      69.0       1
         50.0     Seattle      66.0       1
         54.0     Phoenix      65.0       1
         55.0     UNKNOWN      94.0       1
         58.0     UNKNOWN      79.0       1
         59.0     Los Angeles  92.0       1
UNKNOWN  31.0     Seattle      71.0       1
         33.0     Seattle      53.0       1
         37.0     UNKNOWN      95.0       1
         45.0     Los Angeles  57.0       1
         58.0     Seattle      54.0       1
         UNKNOWN  Houston      UNKNOWN    1
                  UNKNOWN      90.0       1
Name: count, dtype: int64

In [187]:
df10=df.value_counts(ascending=False)

In [188]:
df10

Name     Age      City         Score
Alice    20.0     UNKNOWN      69.0       1
         22.0     Phoenix      86.0       1
         25.0     UNKNOWN      76.0       1
         29.0     New York     97.0       1
         33.0     Seattle      73.0       1
         37.0     New York     55.0       1
Bob      30.0     UNKNOWN      55.0       1
         36.0     Phoenix      83.0       1
         49.0     Los Angeles  93.0       1
         UNKNOWN  Chicago      64.0       1
                  Seattle      88.0       1
Charlie  19.0     Chicago      61.0       1
         32.0     UNKNOWN      74.0       1
         36.0     Phoenix      78.0       1
David    22.0     Houston      82.0       1
         25.0     Phoenix      UNKNOWN    1
         33.0     Seattle      100.0      1
         34.0     New York     66.0       1
         44.0     New York     UNKNOWN    1
         49.0     Chicago      58.0       1
Eve      25.0     Chicago      74.0       1
         47.0     Houston      86.0       1
         48.0     Los Angeles  67.0       1
Frank    25.0     Chicago      98.0       1
         47.0     New York     80.0       1
                  UNKNOWN      68.0       1
         57.0     UNKNOWN      52.0       1
         59.0     New York     81.0       1
         60.0     Chicago      UNKNOWN    1
Grace    25.0     New York     56.0       1
         29.0     Houston      53.0       1
         36.0     Seattle      56.0       1
         45.0     Los Angeles  54.0       1
Hank     22.0     New York     52.0       1
         27.0     UNKNOWN      84.0       1
         30.0     Los Angeles  98.0       1
         37.0     Chicago      UNKNOWN    1
         40.0     Chicago      69.0       1
         50.0     Seattle      66.0       1
         54.0     Phoenix      65.0       1
         55.0     UNKNOWN      94.0       1
         58.0     UNKNOWN      79.0       1
         59.0     Los Angeles  92.0       1
UNKNOWN  31.0     Seattle      71.0       1
         33.0     Seattle      53.0       1
         37.0     UNKNOWN      95.0       1
         45.0     Los Angeles  57.0       1
         58.0     Seattle      54.0       1
         UNKNOWN  Houston      UNKNOWN    1
                  UNKNOWN      90.0       1
Name: count, dtype: int64

In [193]:
df.to_json("large_sample_with_missing_values.json",orient="records",index=False)

In [7]:
import pandas as pd
import os
change="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(change)
df=pd.read_csv("large_sample_with_missing_values.csv")
df1=pd.read_csv("sample_with_missing_values.csv")
# for join we use merge
inner_join=pd.merge(df,df1,on="Age",how="inner")
len(inner_join)

18

In [8]:
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [9]:
inner_join.head()

  Name_x   Age       City_x  Score_x   Name_y       City_y  Score_y
0    Bob   NaN      Seattle     88.0      Bob  Los Angeles     90.0
1    Bob   NaN      Seattle     88.0      Eve      Houston     92.0
2  Frank  25.0      Chicago     98.0    Alice     New York     85.0
3   Hank  30.0  Los Angeles     98.0  Charlie          NaN      NaN
4  Alice  22.0      Phoenix     86.0    David      Chicago     88.0

In [10]:
left_join=pd.merge(df,df1,how="left")

In [11]:
left_join

       Name   Age         City  Score
0       Bob  49.0  Los Angeles   93.0
1       Bob   NaN      Seattle   88.0
2      Hank  37.0      Chicago    NaN
3     Frank  25.0      Chicago   98.0
4     Alice  33.0      Seattle   73.0
5       Bob  36.0      Phoenix   83.0
6     Grace  36.0      Seattle   56.0
7      Hank  30.0  Los Angeles   98.0
8     Alice  22.0      Phoenix   86.0
9     Frank  59.0     New York   81.0
10    Grace  29.0      Houston   53.0
11      Bob  30.0          NaN   55.0
12    Frank  47.0          NaN   68.0
13  Charlie  36.0      Phoenix   78.0
14     Hank  58.0          NaN   79.0
15      NaN   NaN          NaN   90.0
16     Hank  54.0      Phoenix   65.0
17      NaN  37.0          NaN   95.0
18     Hank  50.0      Seattle   66.0
19    David  34.0     New York   66.0
20      NaN  31.0      Seattle   71.0
21      NaN   NaN      Houston    NaN
22    Alice  25.0          NaN   76.0
23      Bob   NaN      Chicago   64.0
24    Grace  25.0     New York   56.0
25    David  22.0      Houston   82.0
26      Eve  48.0  Los Angeles   67.0
27     Hank  40.0      Chicago   69.0
28    Frank  47.0     New York   80.0
29    David  25.0      Phoenix    NaN
30      NaN  58.0      Seattle   54.0
31     Hank  22.0     New York   52.0
32     Hank  55.0          NaN   94.0
33      NaN  33.0      Seattle   53.0
34    Alice  20.0          NaN   69.0
35      Eve  47.0      Houston   86.0
36    Frank  57.0          NaN   52.0
37    Frank  60.0      Chicago    NaN
38      NaN  45.0  Los Angeles   57.0
39     Hank  59.0  Los Angeles   92.0
40     Hank  27.0          NaN   84.0
41  Charlie  32.0          NaN   74.0
42    David  49.0      Chicago   58.0
43    David  44.0     New York    NaN
44    Alice  37.0     New York   55.0
45    Alice  29.0     New York   97.0
46    Grace  45.0  Los Angeles   54.0
47  Charlie  19.0      Chicago   61.0
48      Eve  25.0      Chicago   74.0
49    David  33.0      Seattle  100.0

In [12]:
left_join=pd.merge(df,df1,on="Age",how="left")
len(left_join)

54

In [14]:
right_join=pd.merge(df,df1,on="Age",how="right")
len(right_join)

18

In [15]:
outer_join=pd.merge(df,df1,on="Age",how="outer")
len(outer_join)

54

In [17]:
#indexd based join
df.join(df1,how="inner")

ValueError: columns overlap but no suffix specified: Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [20]:
df2=pd.concat([df,df1])
len(df2)

55

In [22]:
import pandas as pd

df1=pd.DataFrame({"ID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]})
df2=pd.DataFrame({
    "ID": [3, 4, 5, 6],
    "City": ["New York", "Chicago", "Houston", "Phoenix"]
})
inner=pd.merge(df1,df2,how="inner")
print(inner)

   ID     Name      City
0   3  Charlie  New York
1   4    David   Chicago

In [23]:
left=pd.merge(df1,df2,how="left")
print(left)

   ID     Name      City
0   1    Alice       NaN
1   2      Bob       NaN
2   3  Charlie  New York
3   4    David   Chicago

In [25]:
right=pd.merge(df1,df2,how="right")
print(right)

   ID     Name      City
0   3  Charlie  New York
1   4    David   Chicago
2   5      NaN   Houston
3   6      NaN   Phoenix

In [26]:
outer=pd.merge(df1,df2,how="outer")
print(outer)

   ID     Name      City
0   1    Alice       NaN
1   2      Bob       NaN
2   3  Charlie  New York
3   4    David   Chicago
4   5      NaN   Houston
5   6      NaN   Phoenix

In [28]:
df3=pd.concat([df1,df2])
print(df3)

   ID     Name      City
0   1    Alice       NaN
1   2      Bob       NaN
2   3  Charlie       NaN
3   4    David       NaN
0   3      NaN  New York
1   4      NaN   Chicago
2   5      NaN   Houston
3   6      NaN   Phoenix

In [29]:
import pandas as pd
students = pd.DataFrame({
    "Roll_No": [101, 102, 103, 104],
    "Name": ["Aman", "Riya", "Vikram", "Sara"]
})
marks = pd.DataFrame({
    "Roll_No": [103, 104, 105, 106],
    "Marks": [88, 92, 75, 60]
})
#*****************  JOIN  ****************========************====================
inner_1=pd.merge(students,marks,how="inner")
print(inner_1)

   Roll_No    Name  Marks
0      103  Vikram     88
1      104    Sara     92

In [30]:
left_2=pd.merge(students,marks,how="left")
print(left_2)

   Roll_No    Name  Marks
0      101    Aman    NaN
1      102    Riya    NaN
2      103  Vikram   88.0
3      104    Sara   92.0

In [31]:
right_3=pd.merge(students,marks,how="right")
print(right_3)

   Roll_No    Name  Marks
0      103  Vikram     88
1      104    Sara     92
2      105     NaN     75
3      106     NaN     60

In [32]:
outer_4=pd.merge(students,marks,how="outer")
print(outer_4)

   Roll_No    Name  Marks
0      101    Aman    NaN
1      102    Riya    NaN
2      103  Vikram   88.0
3      104    Sara   92.0
4      105     NaN   75.0
5      106     NaN   60.0

In [34]:
df2=pd.concat([students,marks])
print(df2)

   Roll_No    Name  Marks
0      101    Aman    NaN
1      102    Riya    NaN
2      103  Vikram    NaN
3      104    Sara    NaN
0      103     NaN   88.0
1      104     NaN   92.0
2      105     NaN   75.0
3      106     NaN   60.0